app/views/festivals/index.html.erb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."festival_id" IN (2, 1)
SELECT 1 AS one FROM "tasks" WHERE "tasks"."festival_id" = 1 LIMIT 1
---

            <% if festival.tasks.any? %>