app/controllers/festivals_controller.rb

SELECT "festivals".* FROM "festivals" ORDER BY "festivals"."created_at" DESC
SELECT "tasks".* FROM "tasks" WHERE "tasks"."festival_id" IN (2, 1)
SELECT "vendor_applications".* FROM "vendor_applications" WHERE "vendor_applications"."festival_id" IN (2, 1)
---
  def index
    @festivals = Festival.includes(:user, :tasks, :vendor_applications).order(created_at: :desc)

SELECT "tasks".* FROM "tasks" WHERE "tasks"."festival_id" = 2
---
  def show
    authorize! :read, @festival
    @tasks = @festival.tasks.includes(:user)

SELECT "festivals".* FROM "festivals" WHERE "festivals"."id" = 2 LIMIT 1
---
  def set_festival
    @festival = Festival.find(params[:id])